{
  "activation_dropout": 0.0,
  "activation_fn": "swish",
  "bos_token_id": 1,
  "decoder_embed_dim": 2048,
  "decoder_ffn_embed_dim": 3456,
  "decoder_layers": 24,
  "decoder_normalize_before": true,
  "decoder_retention_heads": 8,
  "decoder_value_embed_dim": 3456,
  "deepnorm": false,
  "drop_path_rate": 0.0,
  "dropout": 0.0,
  "eos_token_id": 2,
  "forward_mode": "parallel",
  "groupnorm_eps": 1e-06,
  "initializer_factor": 0.1767766952966369,
  "initializer_range": 0.02,
  "is_decoder": true,
  "lm_head_initializer_range": 0.02209708691207961,
  "model_type": "retnet",
  "no_scale_embedding": false,
  "output_retentions": false,
  "pad_token_id": null,
  "recurrent_chunk_size": 512,
  "rms_norm_embedding": true,
  "rms_norm_eps": 1e-06,
  "subln": true,
  "tie_word_embeddings": false,
  "transformers_version": "4.29.1",
  "use_cache": true,
  "use_ffn_rms_norm": false,
  "use_glu": true,
  "use_lm_decay": false,
  "vocab_size": 32000,
  "z_loss_coeff": 0.0
}