{
  "vocab_size": 50257,
  "decoder_embed_dim": 1280,
  "decoder_value_embed_dim": 2560,
  "decoder_layers": 12,
  "decoder_retention_heads": 8,
  "decoder_ffn_embed_dim": 2560,
  "initializer_range": 0.02,
  "layernorm_eps": 1.0e-5,
  "activation_fn": "gelu",
  "dropout": 0.0,
  "activation_dropout": 0.0,
  "drop_path_rate": 0.0,
  "decoder_normalize_before": true,
  "layernorm_embedding": true,
  "no_scale_embedding": false,
  "recurrent_chunk_size": 512,
  "use_lm_decay": false,
  "deepnorm": false,
  "subln": true,
  "output_retentions": false,
  "pad_token_id": 50256,
  "eos_token_id": 50256,
  "unk_token_id": 50256,
  "forward_impl": "parallel",
  "tie_word_embeddings": false,
  "is_decoder": true,
  "transformers_version": "4.29.1",
  "use_cache": true,
  "model_type": "retnet"
}
