{
  "activation_dropout": 0.0,
  "activation_fn": "swish",
  "decoder_embed_dim": 8192,
  "decoder_ffn_embed_dim": 13824,
  "decoder_layers": 64,
  "decoder_normalize_before": true,
  "decoder_retention_heads": 32,
  "decoder_value_embed_dim": 13824,
  "deepnorm": false,
  "drop_path_rate": 0.0,
  "dropout": 0.0,
  "eos_token_id": 0,
  "forward_impl": "parallel",
  "initializer_range": 0.02,
  "is_decoder": true,
  "layernorm_embedding": true,
  "layernorm_eps": 1e-06,
  "model_type": "retnet",
  "no_scale_embedding": false,
  "output_retentions": false,
  "pad_token_id": 0,
  "recurrent_chunk_size": 512,
  "subln": true,
  "tie_word_embeddings": false,
  "transformers_version": "4.29.1",
  "use_cache": true,
  "use_ffn_rms_norm": false,
  "use_glu": true,
  "use_lm_decay": false,
  "vocab_size": 50257,
  "z_loss_coeff": 0.0
}
